{
  "experiences": [
    {
      "title": "Sr Full Stack/UI Developer",
      "subtitle": "GAP INC., ATLANTA, GA",
      "workType": "Contract",
      "workDescription": ["As a Senior Full Stack/UI Developer at GAP, I developed responsive web applications using React.js, Angular, Next.js, and Node.js. I implemented micro-frontend architecture with React.js, utilizing Redux for state management and ensuring optimal performance. I designed and developed RESTful APIs and integrated WebSocket-based authentication mechanisms for secure communication. Additionally, I collaborated with UX teams to design intuitive UI interfaces and used Babel and Next.js to optimize app performance for SEO. My responsibilities also included managing CI/CD pipelines using Jenkins, Kubernetes, and Git for efficient deployments, as well as optimizing microservices with Spring Boot and Hibernate to streamline data management. I also worked on machine learning model training and optimization using GCP’s AutoML and TensorFlow."],
      "dateText": "Sep 2023 - Present"
    },
    {
      "title": "Full Stack/UI Developer",
      "subtitle": "USAA, SAN ANTONIO, TX",
      "workType": "Contract",
      "workDescription": ["At USAA, I built responsive single-page applications (SPAs) using React.js, Redux, and Node.js, ensuring smooth user interactions and dynamic functionality. I implemented microservice communication patterns using Kafka and integrated data validation within forms using Hibernate Validator. I also optimized the performance of web applications using Lodash and Webpack, and created reusable components using Angular. Additionally, I Dockerized microservices and deployed them on Kubernetes clusters to ensure high availability and scalability. My role also included developing secure Web APIs using SQL Azure and automating the CI/CD process with Jenkins and Docker, which significantly improved deployment efficiency."],
      "dateText": "Feb 2023 - Sep 2023"
    },
    {
      "title": "Software Developer",
      "subtitle": "IBM, INDIA",
      "workType": "Contract",
      "workDescription": ["During my time at IBM, I created dynamic and scalable web applications using Angular, React.js, and Node.js, working on large-scale enterprise projects. I implemented secure JWT-based authentication and integrated frontend user interfaces with a Spring MVC backend. I optimized RESTful services for better performance by utilizing Spring Cache and Redis, significantly reducing response times. I also led the migration of legacy WebSphere Java applications to the MERN stack, improving application performance and scalability. Furthermore, I was responsible for deploying applications on AWS EC2 instances and using S3 for scalable storage management."],
      "dateText": "Jan 2019 - Dec 2022"
    }
  ]
}
